import "./Hero.css";

function Hero() {
  return (
    <main className="main">
      <section className="hero">
        <div className="container hero-container">
          <div className="hero_wrapper">
            <h6 className="glavnaya">Главная / Горячая линия</h6>
            <h1 className="hero_wrapper--title">
              Горячая линия по оказанию юридической помощи онлайн
            </h1>
            <p className="hero_wrapper--desc">
              Профессиональная помощь доступна круглосуточно - заявки
              обрабатываются в любое время дня и ночи. Обращаясь к специалистам
              «100 Юристов», вы можете рассчитывать на прозрачные, понятные
              условия сотрудничества
            </p>
            <div className="hero-btns">
              <a href="" className="btn hero-btn">
                Задать вопрос юристу
              </a>
              <a
                href="tel:+88003029270"
                className="btn hero-bt
              "
              >
                8 800 302-92-70
                <span>Бесплатный звонок юристу 24/7</span>
              </a>
            </div>
            <div className="hero_wrapper-about">
              <span>
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="24"
                  height="24"
                  viewBox="0 0 24 24"
                  fill="none"
                >
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M12 5.25C12.4142 5.25 12.75 5.58579 12.75 6L12.75 11.25L18 11.25C18.4142 11.25 18.75 11.5858 18.75 12C18.75 12.4142 18.4142 12.75 18 12.75L12 12.75C11.5858 12.75 11.25 12.4142 11.25 12L11.25 6C11.25 5.58579 11.5858 5.25 12 5.25Z"
                    fill="#33836E"
                  />
                  <path
                    fillRule="evenodd"
                    clipRule="evenodd"
                    d="M12 2.75C6.89137 2.75 2.75 6.89137 2.75 12C2.75 17.1086 6.89137 21.25 12 21.25C17.1086 21.25 21.25 17.1086 21.25 12C21.25 6.89137 17.1086 2.75 12 2.75ZM1.25 12C1.25 6.06294 6.06294 1.25 12 1.25C17.9371 1.25 22.75 6.06294 22.75 12C22.75 17.9371 17.9371 22.75 12 22.75C6.06294 22.75 1.25 17.9371 1.25 12Z"
                    fill="#33836E"
                  />
                </svg>
                Круглосуточно
              </span>
            </div>
          </div>
          <img src="../../images/logo.svg" alt="" />
        </div>
      </section>
      <section className="yuridik_help">
        <h2 className="yuridik_help--title">Юридическая помощь</h2>
        <p className="yuridik_help-desc">
          Срочно понадобились услуги профессионального юриста или адвоката?
          Решение есть! Наша горячая юридическая линия - возможность оперативно,
          абсолютно бесплатно получить ответ на любой вопрос. Теперь не нужно
          записываться на офлайн-прием и тратить время на поездку и очереди
          перед кабинетом. Профессиональная помощь доступна круглосуточно -
          заявки обрабатываются в любое время дня и ночи. Обращаясь к
          специалистам «100 Юристов», вы можете рассчитывать на прозрачные,
          понятные условия сотрудничества.
        </p>
      </section>
      <section className="free_counsultation">
        <h2 className="free_counsultation--title">
          Как получить бесплатную юридическую консультацию?
        </h2>
        <p className="free_counsultation--desc">
          Задайте вопрос юристу бесплатно круглосуточно и без регистрации
        </p>
        <ul className="free_counsultation--list">
          <li className="free_counsultation--item">
            <svg
              xmlns="http://www.w3.org/2000/svg"
              width="24"
              height="24"
              viewBox="0 0 24 24"
              fill="none"
            >
              <path
                fillRule="evenodd"
                clipRule="evenodd"
                d="M4.06359 1.25L7.81451 1.25C8.12689 1.25 8.40655 1.44361 8.51651 1.73599L9.97195 5.60588C10.0201 5.73398 10.0323 5.87281 10.0072 6.00735L9.27796 9.91931C10.1743 12.0273 11.6549 13.4439 14.1106 14.7146L17.9756 13.9657C18.1128 13.9391 18.2547 13.9514 18.3853 14.0012L22.2671 15.4804C22.5578 15.5912 22.75 15.87 22.75 16.1812L22.75 19.7655C22.75 21.391 21.3178 22.7101 19.6425 22.3456C16.5889 21.6811 10.9317 19.9923 6.96967 16.0303C3.17453 12.2352 1.90298 6.99252 1.47495 4.15869C1.23072 2.54172 2.52752 1.25 4.06359 1.25ZM7.2953 2.75L4.06359 2.75C3.34457 2.75 2.86556 3.32183 2.95813 3.93467C3.3709 6.66748 4.57852 11.5179 8.03033 14.9697C11.6787 18.6181 16.9825 20.2317 19.9615 20.8799C20.6158 21.0222 21.25 20.524 21.25 19.7655L21.25 16.698L18.051 15.479L14.1427 16.2363C13.9801 16.2678 13.8116 16.2446 13.6636 16.1703C10.7693 14.7176 8.89037 12.9954 7.80364 10.2785C7.75085 10.1466 7.73665 10.0023 7.7627 9.86255L8.49431 5.9381L7.2953 2.75Z"
                fill="#33836E"
              />
            </svg>
          </li>
        </ul>
      </section>
    </main>
  );
}

export default Hero;
